package Games;

/**
 * Написать программу моделирующую упрощенную версию игры "Морской бой".
 * Пользователь играет с компьютером.
 * Оба играют на поле, представляющее собой двумерный массив
 * Размер поля задается изначально либо же дайте пользователю выбрать его
 * Пользователь и компьютер выбирают на поле одну ячейку, которая представляет собой единственную 'жизнь',
 * попадаю в которую, ударивший выигрывает
 * Программа запрашивает у пользователя ход(координаты удара) и проверяет не убит ли противник , далее также
 * у компьютера, и до тех пор пока кто-то не выиграет
 * После каждого хода должна отрисовыватся матрица пользователя и компьютера с ихними ходами
 * Хода компьютера рандомные, но можете сделать его умнее дабы он не стрелял в одну и ту же ячейку
 * Вынесите действия игры в методы и соедините их соответствующими вызовами
 */
public class Battle {
    public static void main(String[] args) {

    }
}
